PX4/NuttX/arch/arm/src/stm32/stm32f427ax_rcc.c
/****************************************************************************
 * arch/arm/src/stm32/stm32f427ax_rcc.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <arch/board/board.h>

#include "chip.h"
#include "stm32_pwr.h"
#include "itm_syslog.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Allow up to 100 milliseconds for the high speed clock to become ready.
 * that is a very long delay, but if the clock does not become ready we are
 * hosed anyway.  Normally this is very fast, but I have seen at least one
 * board that required this long, long timeout for the HSE to be ready.
 */

#define HSERDY_TIMEOUT (100 * CONFIG_BOARD_LOOPSPERMSEC)

/* Same for HSI */

#define HSIRDY_TIMEOUT HSERDY_TIMEOUT

/* HSE divisor to yield ~1MHz RTC clock */

#define HSE_DIVISOR (STM32_HSE_FREQUENCY + 500000) / 1000000

/* The FLASH latency depends on the system clock, and voltage input
 * of the microcontroller. The following macros calculate the correct
 * wait cycles for every STM32_SYSCLK_FREQUENCY & BOARD_STM32F4_VDD
 * combination. BOARD_STM32F4_VDD is defined in mV.
 */

#ifndef BOARD_STM32F4_VDD
#  define BOARD_STM32F4_VDD 3300
#endif

#if (BOARD_STM32F4_VDD <= 2100)
#  if (STM32_SYSCLK_FREQUENCY <= 20000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_0
#  elif (STM32_SYSCLK_FREQUENCY <= 40000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_1
#  elif (STM32_SYSCLK_FREQUENCY <= 60000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_2
#  elif (STM32_SYSCLK_FREQUENCY <= 800000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_3
#  elif (STM32_SYSCLK_FREQUENCY <= 100000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_4
#  elif (STM32_SYSCLK_FREQUENCY <= 120000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_5
#  elif (STM32_SYSCLK_FREQUENCY <= 140000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_6
#  elif (STM32_SYSCLK_FREQUENCY <= 160000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_7
#  elif (STM32_SYSCLK_FREQUENCY <= 168000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_8
#  else
#    error "STM32_SYSCLK_FREQUENCY is out of range!"
#  endif
#elif (BOARD_STM32F4_VDD <= 2400)
#  if (STM32_SYSCLK_FREQUENCY <= 22000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_0
#  elif (STM32_SYSCLK_FREQUENCY <= 44000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_1
#  elif (STM32_SYSCLK_FREQUENCY <= 66000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_2
#  elif (STM32_SYSCLK_FREQUENCY <= 880000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_3
#  elif (STM32_SYSCLK_FREQUENCY <= 110000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_4
#  elif (STM32_SYSCLK_FREQUENCY <= 132000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_5
#  elif (STM32_SYSCLK_FREQUENCY <= 154000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_6
#  elif (STM32_SYSCLK_FREQUENCY <= 168000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_7
#  elif (STM32_SYSCLK_FREQUENCY <= 176000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_7
#  elif (STM32_SYSCLK_FREQUENCY <= 180000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_8
#  else
#    error "STM32_SYSCLK_FREQUENCY is out of range!"
#  endif
#elif (BOARD_STM32F4_VDD <= 2700)
#  if (STM32_SYSCLK_FREQUENCY <= 24000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_0
#  elif (STM32_SYSCLK_FREQUENCY <= 48000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_1
#  elif (STM32_SYSCLK_FREQUENCY <= 72000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_2
#  elif (STM32_SYSCLK_FREQUENCY <= 960000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_3
#  elif (STM32_SYSCLK_FREQUENCY <= 120000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_4
#  elif (STM32_SYSCLK_FREQUENCY <= 144000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_5
#  elif (STM32_SYSCLK_FREQUENCY <= 168000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_6
#  elif (STM32_SYSCLK_FREQUENCY <= 180000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_7
#  else
#    error "STM32_SYSCLK_FREQUENCY is out of range!"
#  endif
#elif (BOARD_STM32F4_VDD <= 3600)
#  if (STM32_SYSCLK_FREQUENCY <= 30000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_0
#  elif (STM32_SYSCLK_FREQUENCY <= 60000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_1
#  elif (STM32_SYSCLK_FREQUENCY <= 90000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_2
#  elif (STM32_SYSCLK_FREQUENCY <= 120000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_3
#  elif (STM32_SYSCLK_FREQUENCY <= 150000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_4
#  elif (STM32_SYSCLK_FREQUENCY <= 168000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_5
#  elif (STM32_SYSCLK_FREQUENCY <= 180000000)
#    define FLASH_ACR_LATENCY_SETTING  FLASH_ACR_LATENCY_5
#  else
#    error "STM32_SYSCLK_FREQUENCY is out of range!"
#  endif
#else
#  error "BOARD_STM32F4_VDD is out of range!"
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rcc_reset
 *
 * Description:
 *   Reset the RCC clock configuration to the default reset state
 *
 ****************************************************************************/

static inline void rcc_reset(void)
{
  uint32_t regval;

